<script setup>
import { onLoad, onShareAppMessage } from '@dcloudio/uni-app'
import { ref } from 'vue'

const title = ref('')

onLoad((options) => {
  if (options.title) {
    title.value = decodeURIComponent(options.title)
  }
})

onShareAppMessage(() => {
  return {
    title: '高清电子文档一键转换',
    imageUrl: 'https://hnenjoy.oss-cn-shanghai.aliyuncs.com/scantool/static/share-img.jpg',
    path: '/pages/index/index',
  }
})

</script>

<template>
  <view class="vip-protocol">
    <view class="title">{{ title }}</view>
    <view>欢迎使用海南韦肯信息科技有限公司（以下简称「韦肯科技」）产品（包括但不限于网站、移动客户端）及服务！ 为使用「韦肯科技」产品以及服务，请务必仔细阅读本条款并同意本声明。 任何直接或通过各类方式间接使用「韦肯科技」服务或数据的行为，都将被视作已无条件接受本声明所涉全部内容或服务；若使用人对本声明(包括但不限于隐私政策、知识产权、信息和数据、免责声明)的任何条款有异议，请停止使用韦肯科技提供的全部内容和服务。</view>
    <view class="sub-title">一、基本条款</view>
    <view>1.1 您同意仅基于本协议许可目的以及仅在适用的司法管辖区任何适用法律、法规或普遍接受的做法允许的范围内使用本服务。</view>
    <view>1.2 如果您对本服务的使用或其他行为有意或无意地威胁「韦肯科技」提供本服务或其他系统的能力，「韦肯科技」有权采取一切合理步骤保护本服务和「韦肯科技」的系统，当中可能包括暂停您访问本服务。如屡次违反限制，可能会导致终止您的帐户。</view>
    <view>1.3「韦肯科技」提供的服务始终在不断发展，「韦肯科技」提供的服务的形式和性质可能会不时发生变化，恕不另行通知。此外，我们可能会（永久或暂时）停止向您或用户提供服务（或服务中的任何功能），并且可能无法提前通知您。我们还保留随时自行决定限制使用和存储的权利，恕不另行通知。</view>
    <view class="sub-title">二、隐私</view>
    <view>2.1 您或其他用户向「韦肯科技」提供的任何信息均受我们的隐私政策的约束，该政策规定了我们对您的信息的收集和使用。 您了解通过使用服务，您同意收集和使用此信息，包括将此信息传输至中华人民共和国和/或其他国家/地区，以供「韦肯科技」存储，处理和使用。作为向您提供服务的一部分，我们可能需要向您提供某些通信，例如服务通告和管理消息。这些通信被视为服务和您的帐户的一部分，您可能无法选择退出接收。</view>
    <view>三、服务内容</view>
    <view>3.1 使用本服务而可能产生或发现的任何信息，如数据文档、装置特性、书面文本、软件、音乐、图形、图片、图像、声音、视频、信息和任何其他类似材料。您理解，所有内容，无论是通过本服务公开发布的还是以私人方式传输的，均由其来源人负全责。这意味着您而非「韦肯科技」对您通过使用本服务上载、下载、发布、以电邮发送、传输、存储或以其他方式提供的任何内容负全责。任何使用或依赖通过服务发布或通过服务获得的任何内容或材料的风险由您自行承担。</view>
    <view>3.2 我们不认可，支持，声明或保证通过服务发布的任何内容或通信的完整性，真实性，准确性或可靠性，或认可通过服务表达的任何意见。您了解通过使用服务，您可能会接触到可能令人反感，有害，不准确或不适当的内容，或者在某些情况下，可能会发布错误标记或具有欺骗性的内容。在任何情况下，「韦肯科技」均不对任何内容承担任何责任，包括但不限于任何内容中的任何错误或遗漏，或因使用任何内容而发生的任何损失或损害，通过电子邮件发送通过服务传送或以其他方式提供或在其他地方广播。</view>
    <view class="sub-title">四、软件的获取、安装、卸载与更新</view>
    <view>4.1 你可以直接从「韦肯科技」的网站上获取本软件，也可以从得到「韦肯科技」授权的第三方获取。</view>
    <view>4.2 如果你从未经「韦肯科技」授权的第三方获取本软件或与本软件名称相同的安装程序，「韦肯科技」无法保证该软件能够正常使用，并对因此给你造成的损失不予负责。</view>
    <view>4.3「韦肯科技」可能为不同的终端设备开发了不同的软件版本，你应当根据实际情况选择下载合适的版本进行安装。</view>
    <view>4.4 下载安装程序后，你需要按照该程序提示的步骤正确安装。</view>
    <view>4.5 如果你不再需要使用本软件或者需要安装新版软件，可以自行卸载。如果你愿意帮助「韦肯科技」改进产品服务，请告知卸载的原因。</view>
    <view>4.6 为了改善用户体验、完善服务内容，「韦肯科技」将不断努力开发新的服务，并为你不时提供软件更新（这些更新可能会采取软件替换、修改、功能强化、版本升级等形式）。</view>
    <view>4.7 为了保证本软件及服务的安全性和功能的一致性，「韦肯科技」有权不经向你特别通知而对软件进行更新，或者对软件的部分功能效果进行改变或限制。</view>
    <view>4.8 本软件新版本发布后，旧版本的软件可能无法使用。「韦肯科技」不保证旧版本软件继续可用及相应的客户服务，请你随时核对并下载最新版本。</view>
    <view class="sub-title">五.您的权利</view>
    <view>5.1 在服务上公开发布或显示的内容，知识产权均归用户本人所有。您授予我们在全球范围内非独占、免版税许可（具有再许可权）的使用、复制处理、改编、修改，发布，在任何和所有媒体或分发服务（现在已知或以后开发）中显示和分发此类内容。</view>
    <view>5.2 您同意本许可包括「韦肯科技」提供，推广和改进服务的权利，以及向与「韦肯科技」合作进行联合，广播，分发或发布的其他公司，组织或个人提供或通过服务提交的内容的权利此类内容适用于其他媒体和服务，但须遵守我们对此类内容使用的条款和条件。</view>
    <view>5.3「韦肯科技」或与「韦肯科技」合作的其他公司、组织或个人的此类额外用途可能无法就您通过服务提交，发布，传输或以其他方式提供的内容向您支付任何赔偿。</view>
    <view>5.4 我们可能会修改或调整您的内容，以便通过计算机网络和各种媒体传输，显示或分发您的内容和/或对内容进行更改，以使内容符合并使其适应任何网络，设备的任何要求或限制，服务或媒体。</view>
    <view>5.5 您对使用服务，使用您提供的任何内容及其后果（包括其他用户和我们的第三方合作伙伴使用您的内容）负责。您了解您的内容可能由我们的合作伙伴进行联合，广播，分发或发布。您不得侵犯他人包括版权在内的知识产权及其他权利。我们对根据本条款使用您的内容不承担任何责任。您声明并保证您拥有将此处授予的权利授予您提交的任何内容所需的所有权利，权力和权限。</view>
    <view>5.6 您也可以向我们报告令人反感的内容。</view>
    <view class="sub-title">六.您使用服务的许可</view>
    <view>6.1 您承认并同意，「韦肯科技」和/或其许可人对本服务（包括但不限于用于执行本服务的图形、用户界面、脚本和软件）及作为本服务一部分和/或与本服务相关而向您提供的任何软件（“软件”）拥有一切法定权利、所有权和利益，包括其中存在的任何及所有知识产权，无论是否注册，也无论位于世界何地。您进一步同意本服务（包括其中的软件及任何其他部分）包含专有和机密资料，受适用的知识产权法和其他法律（包括但不限于著作权法律）的保护。您同意，您不会以任何方式使用该等专有信息或材料，但为了根据本协议使用本服务的目的而使用的除外。除本协议条款明确允许的以外，不得以任何形式或任何方式复制本服务的任何部分。</view>
    <view>6.2 除本协议中允许的对本服务的使用外，对软件或本服务的任何部分的使用均是严格禁止的，此等使用侵犯他人的知识产权，可能使您因侵犯著作权而受到民事和刑事处罚，包括可能支付损害赔偿金。</view>
    <view>6.3「韦肯科技」为您提供个人，全球，不可转让和非独占许可，以使用「韦肯科技」作为服务一部分提供给您的软件。本许可的唯一目的是使您能够以这些条款允许的方式使用和享受「韦肯科技」提供的服务的好处。</view>
    <view class="sub-title">七、其他</view>
    <view>7.1 你使用本软件即视为你已阅读并同意受本协议的约束。「韦肯科技」有权在必要时修改本协议条款。你可以在本软件的最新版本中查阅相关协议条款。本协议条款变更后，如果你继续使用本软件，即视为你已接受修改后的协议。如果你不接受修改后的协议，应当停止使用本软件。</view>
    <view>7.2 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。</view>
    <view>7.3 本协议可能存在包括中文、英文在内的多种语言的版本，如果存在中文版本与其他语言的版本相冲突的地方，以中文版本为准。</view>
    <view>7.4 本协议中的标题仅为方便而设，在解释本协议时应被忽略，不能作为本协议条款解释的依据。</view>
    <view style="margin-top: 40rpx">海南韦肯信息科技有限公司</view>
  </view>
</template>

<style scoped lang="scss">
.vip-protocol {
  padding: 0 20rpx 40rpx;
  font-size: 26rpx;

  line-height: 1.6;

  .title {
    text-align: center;
    font-weight: bold;
    font-size: 40rpx;
    padding: 20rpx 0;
  }

  .sub-title {
    font-weight: bold;
    font-size: 32rpx;
    padding: 10rpx 0;
  }
}
</style>